#include <iostream>
using namespace std;
int main() {
	setlocale(0, "");
	short a;
	cin >> a;
if (a >= 0 && a <= 10) {
cout << "вы попали в диапозон 0-10";
}
else if (a >= 0 && a <= 20) {
cout << "вы попали в диапозон 11-20";
}
else if (a >= 0 && a <= 30) {
cout << "вы попали в диапозон 21-30";}
else
if (a >= 0 && a <= 40) {
cout << "вы попали в диапозон 31-40";
}
else
if (a >= 0 && a <= 50) {
cout << "вы попали в диапозон 41-50";
}
else
if (a >= 0 && a <= 60) {
cout << "вы попали в диапозон 51-60";
}
else
if (a >= 0 && a <= 70) {
cout << "вы попали в диапозон 61-70";
}
else
if (a >= 0 && a <= 80) {
cout << "вы попали в диапозон 71-80";
}else
if (a >= 0 && a <= 90) {
cout << "вы попали в диапозон 81-90";
}
else
if (a >= 0 && a <= 100) {
cout << "вы попали в диапозон 91-100";
}
else
cout << "Вы ввели число не попадающее в диапозон 0-100";
}